# Reset Data and New Setup
নির্দিত কমান্ডগুলি Git এবং GitHub রিপোজিটরি সাথে কাজ করার জন্য ব্যবহার করা হয়, তবে এই কমান্ড সমস্যায় পড়তে পারে এবং আপনার রিপোজিটরি ডেটা হারানোর আশঙ্কা আছে।

এই কমান্ডগুলি ব্যবহার করার আগে, আপনার রিপোজিটরির ডেটা এবং কনফিগারেশন ব্যবস্থাপনা নিশ্চিত করুন।

এই ধরণের কাজ করার আগে সতর্কতা সাবধান রেখে যান এবং ডেটা নুকশানের আশঙ্কা থাকলে আপনার ডেটা নিশ্চিত ভাবে ব্যাকআপ করুন।

যদি আপনি নিশ্চিত হন এই কমান্ড ব্যবহার করতে চান তবে রিপোজিটরি থেকে .git ডিরেক্টরি বিলাপ করার মাধ্যমে রিপোজিটরি পুরোনো করে নিন এবং একটি নতুন Git রিপোজিটরি সৃজন করুন:

1. `.git` ডিরেক্টরি বিলাপ করুন:
   ```
   rm -rf .git
   ```

2. একটি নতুন Git রিপোজিটরি সৃজন করুন:
   ```
   git init
   ```

3. সমস্ত ফাইলগুলি স্টেজ করুন:
   ```
   git add .
   ```

4. প্রথম কমিট সৃজন করুন:
   ```
   git commit -m "first commit"
   ```

5. মাস্টার ব্রাঞ্চ কে নতুন নাম দিন (যদি নিশ্চিত হন):
   ```
   git branch -M main
   ```

6. রিমোট রিপোজিটরির লিংক যোগ করুন:
   ```
   git remote add origin <আপনার-রিপোজিটরি-লিংক>
   ```

7. পুশ করুন:
   ```
   git push -u origin main -f
   ```

এই কমান্ডগুলি সতর্কতাসহ ব্যবহার করুন এবং সতর্কতা সাবধানী মেনে নিন, কারণ এই কমান্ডগুলি পুরোনো রিপোজিটরির ডেটা মুছে ফেলতে পারে এবং ডেটা পুনরুদ্ধার সম্ভাবনা নিয়ে অসুরক্ষিত করতে পারে।

# Branch Reset and Pulling Everything
1. ব্রাঞ্চ এর ডাটা ফেচ করুন:
   ```
   git fetch origin main
   ```
2. এবার ব্রাঞ্চ এর ডাটা রিসেট করার জন্য নিচের কমান্ডটি চালান:
   ```
   git reset --hard FETCH_HEAD
   ```
